# InSession Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintSetup..::..InSession Property
PrintSetup Class See Also
---
The in-session Print Setting of Print Setup.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public InSessionPrintSetting InSession { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InSession As InSessionPrintSetting
	Get
```

Visual C++
---
```text
public:
property InSessionPrintSetting^ InSession {
	InSessionPrintSetting^ get ();
}
```

# See Also
PrintSetup Class
Autodesk.Revit.DB Namespace